# GetLoadContent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadData..::..GetLoadContent Method
ExternalResourceLoadData Class See Also
---
Returns the ExternalResourceLoadContent resulting from this load operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceLoadContent GetLoadContent()
```

Visual Basic
---
```text
Public Function GetLoadContent As ExternalResourceLoadContent
```

Visual C++
---
```text
public:
ExternalResourceLoadContent^ GetLoadContent()
```

# ### Return Value
A reference to an ExternalResourceLoadContent object.
# Remarks
This object contains the content produced by the call to the IExternalResourceServer's LoadResource method.
# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace